{
  "titles": {
    "133": "BrainCo Intelligent Bionic Hand Shines at Asian Para Games Opening Ceremony, Assists Torchbearer in Lighting the Sacred Flame!",
    "69": "BrainCo Intelligent Bionic Hand Shines at Asian Para Games Opening Ceremony, Assists Torchbearer in Lighting the Sacred Flame!",
    "281": "This Kick Didn't Hit the Goal, But Broke Through the Siege of Fate | Zhejiang Province Technology-Assisted Public Welfare Project for People with Limb Disabilities",
    "280": "BrainCo Settles in Hong Kong Cyberport, Responds to Policy Address to Benefit Disabled Groups with Intelligent Prosthetics",
    "279": "Protecting Cognitive Abilities, Making the Brain 'Age Backwards' | China Brain Health Day",
    "278": "Escorting Disabled Youth in Pursuing Dreams, Brain-Computer Technology Ignites the Light of Hope",
    "276": "Macao SAR Chief Executive Sam Hou Fai Visits BrainCo",
    "275": "Winning Over the Audience! BrainCo Shines at 2025 World Robot Conference, Brain-Computer Interface Technology Featured on CCTV News Again",
    "274": "'With This Hand, I Can Shake Hands with the World Again' | National Day for People with Limb Disabilities",
    "272": "18-Year-Old Skiing Champion Climbs Stairs on Her Own for the First Time | Zhejiang Technology-Assisted Public Welfare Project",
    "273": "From Harvard to Brain-Computer Interface: BrainCo's Entrepreneurial Journey",
    "271": "CCTV Major Release! BrainCo's Han Bicheng Wins China's '2025 AI Person of the Year'",
    "270": "BrainCo Partner He Xiyujin Invited to Participate in Chain Expo Digital Technology Thematic Discussion",
    "269": "BrainCo's Han Bicheng Meets with Hong Kong Chief Executive John Lee, Participates in Chief Executive's Advisory Group Meeting",
    "268": "BrainCo Makes Stunning Appearance at Osaka World Expo, Depicting Poetic Zhejiang with Technology",
    "267": "BrainCo Partners with Shanghai Children's Welfare Institute to Create Children's Brain-Computer Rehabilitation Innovation Training Center",
    "266": "BrainCo × Sleemon | Creating New Paradigm of AI Mattress Human-Computer Interaction, Exploring New Future of Cross-Industry Integration",
    "265": "Senegalese Prime Minister Sonko Visits Zhejiang, Conducts Research at BrainCo",
    "264": "BrainCo Partner He Xiyujin Invited to Participate in 16th Summer Davos Forum",
    "263": "Major List Announced! BrainCo's Han Bicheng Appointed as Hong Kong Chief Executive's Advisor",
    "261": "Walking with Excellence, Making Every Step More Powerful | BrainCo Prosthetics Dealer Conference Highlights",
    "260": "BrainCo's First National Brain-Computer Science Innovation Demonstration Center Settles in Wuxi",
    "259": "General Secretary Xi Jinping Sends Congratulations to National Self-improvement Models and Advanced Disability Assistance Workers, Premier Li Qiang Meets with Representatives",
    "258": "Ending the 'Fish and Bear's Paw' Dilemma! BrainCo Releases Lightest Dexterous Hand, Grip-to-Weight Ratio of 52:1 Sets Industry Record",
    "257": "CCTV News | 30-Second Wearing, Power Bank Charging - How Advanced is China's Bionic Hand?",
    "256": "BrainCo × Leapmotor | Creating Public Welfare 'China Solution', Technology Assisting Disabled for Better Life",
    "255": "Hong Kong SAR Chief Executive John Lee Leads Delegation to Visit Zhejiang, Conducts Inspection at BrainCo",
    "254": "China Cyberspace | 'Hangzhou Six Dragons' BrainCo: Why Do We Make Brain-Computer Interfaces?",
    "253": "CPPCC Research Group Visits Zhejiang, Led by Zhu Yongxin to Inspect BrainCo",
    "252": "BrainCo and Beijing Brain Science and Brain-Inspired Research Institute Jointly Build Brain-Computer Interface Innovation Center, Creating National BCI Innovation Highland",
    "251": "Provincial CPPCC Holds Political-Enterprise Consultation Meeting, BrainCo's Han Bicheng and Representatives Make Exchange Speeches",
    "250": "Fujian Provincial Party and Government Delegation Visits Zhejiang for Inspection, Hears BrainCo's Enterprise Development Introduction",
    "249": "Exclusive Interview with Han Bicheng: Beyond 'Hangzhou Six Dragons' Label, Focusing on Technology to Solve Real Problems",
    "248": "Minister of Science and Technology Yin Hejun Conducts Research on Scientific and Technological Innovation Work in Hangzhou, Zhejiang, Inspects BrainCo's Development Achievements",
    "247": "BrainCo Wins Double Awards in Smart Sleep Field, Leading New Trend in Sleep Health | World Sleep Day",
    "246": "BrainCo Shines at Mobile World Congress, Intelligent Bionic Technology Empowers Global Ecosystem Partners | 2025 MWC",
    "245": "2025 Yabuli Forum | BrainCo Founder Han Bicheng Delivers Keynote Speech at Opening Ceremony",
    "244": "The Paper | Hangzhou's 'Six Dragons' That Went Viral Become Honored Guests of Zhejiang Provincial Party Secretary",
    "243": "BrainCo Selected as National-Level Specialized and New 'Little Giant' Enterprise",
    "242": "Live Preview | BrainCo Founder Han Bicheng Dialogues with BGI CEO Yin Ye, Exploring 'From Brain-Computer Interface to Origin of Consciousness'!",
    "241": "First in China! BrainCo's Intelligent Rehabilitation Products Debut at National Autism Children's Special Education Resource Center",
    "240": "BrainCo Partners with Tsinghua University Southeast Asia Center and UID Foundation: Innovative Cooperation, Building the Future Together",
    "239": "Join the Light of Technology! BrainCo Invited to Participate in '2025 Technology New Year Live Broadcast'",
    "238": "Academicians Gather at First CCTV 'Technology Evening', BrainCo Performs New Quality 'Symphony'",
    "236": "BrainCo × Realman | Jointly Promoting the 'Re-evolution' of Embodied Intelligence Human-Computer Interaction Mode",
    "235": "Winning Two Major Industry Awards! BrainCo Intelligent Bionic Dexterous Hand Empowers Embodied Intelligence Innovation Applications",
    "234": "BrainCo Partner He Xiyujin Invited to Attend 2024 Fortune MPW Women's Summit",
    "233": "First Release, Leading the Future! BrainCo Selected for '2024 Hurun China Healthcare Rising Star Enterprises'",
    "231": "BCI Conference: Global Experts Discuss Brain-Computer Interface Technology Innovation, BrainCo Theme Cocktail Party Successfully Held",
    "230": "International Day of Persons with Disabilities | Shining on the Field, BrainCo Intelligent Prosthetics Debut at Disabled Future Tech Sports Meeting",
    "229": "BrainCo Shines at 2nd Chain Expo, Promoting Industrial Cooperation and Technology Integration",
    "228": "Pediatric Experts Professor Jin Xingming and Professor Mark Simms Visit BrainCo for Exchange",
    "227": "2024 Hangzhou Investment Environment Promotional Video 'In Hangzhou, Light Up the Future' Debuts, Dedicated to Everyone Working Hard to Shine!",
    "226": "BrainCo's Han Bicheng Participates in APEC as Member of Chinese Entrepreneur Delegation",
    "225": "BrainCo Intelligent Bionic Hand Wins 2024 Canton Fair Design Innovation Award (CF Award) Supreme Gold Award",
    "224": "Singapore Minister for Communications and Information Mrs. Josephine Teo Visits BrainCo for Inspection",
    "223": "CCPIT Deputy Chairman Yu Jianlong Visits Zhejiang BrainCo Technology Co., Ltd. for Research",
    "222": "Vice Minister of Commerce Wang Shouwen Inspects BrainCo's Canton Fair Booth",
    "221": "MIIT Vice Minister Wang Jiangping: Increase Financial Support for Unicorn Companies, Support IPO, M&A, Restructuring, etc.",
    "220": "BrainCo Partner and Senior Vice President He Xiyujin Named in 2024 Fortune China's Most Powerful Women Future List",
    "219": "CCTV National Day Special | To Help Them 'Grow' Arms, This PhD Washes Hair 4 Times a Day",
    "218": "Li Binhao: He Made the Decision to Amputate for Himself, and Transformed Himself into a 'Slash' Youth | Technology Lights Up Dreams, Let Love Be Strength",
    "217": "BrainCo and Other Enterprises Reach Strategic Cooperation with DingTalk, Jointly Opening Digital Intelligence Era | 2024 Yunqi Conference",
    "215": "Frontier Exploration of AI + Brain-Computer Technology, BrainCo Shines at Bund Conference | 2024 Inclusion",
    "214": "Official Announcement! Hangzhou City Song Officially Released, BrainCo Intelligent Bionic Hand Makes Appearance!",
    "213": "BrainCo Intelligent Bionic Dexterous Hand Debuts at World Robot Conference, Giving Humanoid Robots 'Fine Operation' Ability | 2024WRC",
    "212": "Gao Ruixia: When Providing Exhibition Design for Disabled Users, I Can Better Consider Their Psychology | Technology Lights Up Dreams, Let Love Be Strength",
    "211": "Dexterous Hands Lead Humanoid Robots to Be 'Dexterous' | Xinhua News Agency",
    "210": "Focus on Paris Paralympics, Five BrainCo Prosthetic Athletes Ready to Go!",
    "209": "On the List! BrainCo Selected for MIIT Artificial Intelligence Medical Device Innovation Task Outstanding Units",
    "207": "Hong Kong SAR Government Chief Secretary for Administration Eric Chan Visits BrainCo",
    "206": "Playing with Intelligent Prosthetics to the Extreme, Blade Runner's 'Evolution Journey' | National Day for People with Limb Disabilities",
    "205": "XPeng Motors × BrainCo Meditation | Enjoy Stress Relief Experience Anytime, Anywhere",
    "204": "Fusion of Technology and Art, BrainCo Intelligent Bionic Hand Debuts at Beijing National Museum of China | Design Intelligence and High-Quality Development Special Exhibition",
    "208": "BrainCo Shines at 2024 World Artificial Intelligence Conference | 2024 WAIC",
    "202": "Exploring AI + Brain-Computer Interface Application Innovation | BrainCo Shines at DingTalk Ecosystem Conference",
    "201": "Developing New Quality Productive Forces, Promoting Common Prosperity in High-Quality Development | People's Daily",
    "200": "BrainCo Selected for '2023 Yangtze River Delta Business Innovation Samples' | 6th Yangtze River Delta Business Innovation Conference",
    "199": "China (Chongqing) Unicorn Enterprise Conference | BrainCo Founder Han Bicheng Delivers Keynote Speech",
    "198": "Human Immortality, How Far Are We? - Ren Zeping Dialogues with Han Bicheng",
    "197": "CCPIT Chairman Ren Hongbin Visits BrainCo for Inspection",
    "196": "Technology Assisting Disabled, Bringing Better Life for People with Disabilities | 2024 'Connected China Public Welfare Action'",
    "195": "BrainCo Founder and CEO Han Bicheng Delivers Keynote Speech | TEDxCEIBS 2024 Annual Conference",
    "194": "Embracing the Unknown, BrainCo Shines at BEYOND Expo 2024",
    "193": "With Brain-Computer Technology, Interpreting the Beauty of 'Wing Chun' | National Disability Assistance Day",
    "192": "BrainCo Shines at Zhongguancun Forum, Selected for '2024 Brain-Computer Interface Industry Innovation Top Ten Cases'",
    "191": "Shandong Provincial Party and Government Delegation Studies and Inspects in Zhejiang, Investigates BrainCo's Development",
    "190": "BrainCo Shines at Canton Fair, Connecting Global Markets with New Quality Productive Forces",
    "189": "BrainCo Wins 7 Design 'Oscar' Awards | German iF Design Award",
    "188": "Focus on Two Sessions | Promoting Industrial Innovation through Scientific and Technological Innovation, Brain-Computer Interface Empowers 'New Quality Productive Forces'",
    "187": "Liu Jie Has Breakfast with Private Entrepreneurs, What Was Discussed at the First 'Breakfast Meeting' of the New Year?",
    "186": "BrainCo Wins 'Influential Zhejiang Business Group Award' | 2023 Annual Influential Zhejiang Business",
    "185": "Breaking Boundaries · Influence Charity Forum | BrainCo Founder and CEO Han Bicheng Delivers Speech",
    "184": "BrainCo Receives Caijing 'Annual Frontier Technology Innovation Award'",
    "183": "BrainCo Receives 'Annual Most Investment Potential Award' | Yicai 6th Investment Annual Conference",
    "182": "2023 China Design Intelligence Award | BrainCo Wins Industrial Group Gold Award",
    "178": "2023 World Young Scientists Summit | BrainCo Dialogues with Nobel Laureates, Exploring Brain-Computer Interface Development Trends",
    "177": "Jiemian REAL Conference | BrainCo Partner and Senior Vice President He Xiyujin Invited to Deliver Speech",
    "74": "Thank You Letter Delivered to BrainCo | Technological Miracle in the Asian Games Event",
    "75": "International Day of Persons with Disabilities | Zhejiang Province Technology-Assisted Public Welfare Project for People with Limb Disabilities Officially Released, Hangzhou High-Tech Enterprise Disability Assistance Alliance Officially Launched",
    "135": "'Mind Over Matter' Brain-Computer Interface 'Connects' New Industrial Space",
    "143": "BrainCo's Dr. Yang Jinchen Listed in 36kr 2022 Global Chinese Elite Power100, Awarded Young Scientific Research Leader",
    "142": "BrainCo Listed in '2022 China Unicorn Enterprises'",
    "141": "36kr Exclusive Interview | BrainCo Han Bicheng: Future Brain-Computer Devices Will Be More Common Than Phones, But We Will Be More Elegant Than Cyberpunk",
    "140": "Han Bicheng Invited to Participate in CCTV 'Dialogue' Program | Brain-Computer Interface Technology, Exploring Infinite Possibilities",
    "139": "36kr Exclusive Interview | BrainCo Han Bicheng: Future Brain-Computer Devices Will Be More Common Than Phones, But We Will Be More Elegant Than Cyberpunk",
    "138": "China Disabled Persons' Federation Chairman Cheng Kai Inspects Yuhang High-Tech Assistive Device Exhibition Hall and Visits BrainCo Product Exhibition Area",
    "137": "BrainCo: Building the Technology Foundation for Future Brain-Computer Devices",
    "134": "BrainCo Intelligent Bionic Leg Debuts at Asian Para Games Torch Relay for the First Time!",
    "136": "BrainCo Founder Han Bicheng Invited to Attend China Digital Trade Dialogue Forum and Deliver Speech",
    "85": "On the List! 2022 China Unicorn Enterprise Research Report Released, BrainCo Successfully Selected",
    "83": "BrainCo Listed on 2022 Zhejiang Province Innovative SME List!",
    "105": "CCTV-2 [First Time]: Domestic Intelligent Bionic Hand Assists Winter Paralympic Torch Relay",
    "104": "CCTV-13 [News Live Room]: Focus on Beijing 2022 Winter Paralympics, Domestic Intelligent Bionic Hand Assists Winter Paralympic Torch Relay",
    "78": "China Disabled Persons' Federation Chairman Cheng Kai Inspects Yuhang High-Tech Assistive Device Exhibition Hall and Visits BrainCo Product Exhibition Area",
    "77": "BrainCo: Building the Technology Foundation for Future Brain-Computer Devices",
    "76": "2023 World Young Scientists Summit | BrainCo Dialogues with Nobel Laureates, Exploring Brain-Computer Interface Development Trends",
    "73": "A Special Four-Hand Piano Performance Made DNA Move......",
    "72": "BrainCo Founder Han Bicheng Invited to Attend China Digital Trade Dialogue Forum and Deliver Speech",
    "79": "36kr Exclusive Interview | BrainCo Han Bicheng: Future Brain-Computer Devices Will Be More Common Than Phones, But We Will Be More Elegant Than Cyberpunk",
    "71": "'Mind Over Matter' Brain-Computer Interface 'Connects' New Industrial Space",
    "70": "BrainCo Intelligent Bionic Leg Debuts at Asian Para Games Torch Relay for the First Time!"
  }
}

